In [1]:
# most of the methods and attributes of series are applicable of dataframe also

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("students.csv")
df

    id name of students  marks
0    1            nitin    200
1    2             arun    300
2    3            pinky    400
3    4            simmi    500
4    5            tannu    400
5    6            kajal    800
6    7         himanshu    900
7    8             riya   1000
8    9             tina    400
9   10             sonu    500
10  11             anil   1000
11  12              ram    300
12  13             ritu    200
13  14          kaushal    800
14  15            padam    700
15  16           manish    200
16  17             renu    600
17  18             monu    300
18  19            ankit    200
19  20           pankaj    400

In [20]:
df = pd.read_csv("students.csv" , index_col = "id")

print(df.head(n = 4))

print(df.tail(n = 3))

   name of students  marks
id
1             nitin    200
2              arun    300
3             pinky    400
4             simmi    500
   name of students  marks
id
18             monu    300
19            ankit    200
20           pankaj    400

In [28]:
print(df.shape)
print(df.ndim)
print(df.size)
print(df.index)
print(df.values)

(20, 2)
2
40
Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
            20],
           dtype='int64', name='id')
[['nitin' 200]
 ['arun' 300]
 ['pinky' 400]
 ['simmi' 500]
 ['tannu' 400]
 ['kajal' 800]
 ['himanshu' 900]
 ['riya' 1000]
 ['tina' 400]
 ['sonu' 500]
 ['anil' 1000]
 ['ram' 300]
 ['ritu' 200]
 ['kaushal' 800]
 ['padam' 700]
 ['manish' 200]
 ['renu' 600]
 ['monu' 300]
 ['ankit' 200]
 ['pankaj' 400]]

In [29]:
# info() method

In [33]:
import pandas as pd

df = pd.read_csv("students.csv")

print(df.info())    # only for dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                20 non-null     int64
 1   name of students  20 non-null     object
 2   marks             20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 464.0+ bytes
None

In [39]:
import pandas as pd

df = pd.read_csv("students.csv")

print(df.info(verbose = False))   # for summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Columns: 3 entries, id to marks
dtypes: int64(2), object(1)
memory usage: 464.0+ bytes
None

In [111]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,None]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , pd.NA]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla
4   50   None  5000       <NA>

In [48]:
df.info(show_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eno     5 non-null      int64
 1   ename   4 non-null      object
 2   esal    5 non-null      int64
 3   eadrs   4 non-null      object
dtypes: int64(2), object(2)
memory usage: 184.0+ bytes

In [51]:
df.info(null_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eno     5 non-null      int64
 1   ename   4 non-null      object
 2   esal    5 non-null      int64
 3   eadrs   4 non-null      object
dtypes: int64(2), object(2)
memory usage: 184.0+ bytes

<ipython-input-51-a6d95acf2e87>:1: FutureWarning: null_counts is deprecated. Use show_counts instead
  df.info(null_counts = True)

In [53]:
df.info(null_counts = False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   eno     int64
 1   ename   object
 2   esal    int64
 3   eadrs   object
dtypes: int64(2), object(2)
memory usage: 184.0+ bytes

<ipython-input-53-ce316d47521b>:1: FutureWarning: null_counts is deprecated. Use show_counts instead
  df.info(null_counts = False)

In [54]:
# sample() method
# we can use sample method to get random records

In [6]:
import pandas as pd

df = pd.read_csv("students.csv" , index_col = "id")

# print(df.sample())

print("******************")

print(df.sample(n= 7))

******************
   name of students  marks
id
9              tina    400
10             sonu    500
4             simmi    500
1             nitin    200
16           manish    200
3             pinky    400
14          kaushal    800

In [69]:
# to get specified fraction of records from total
# we have to use frac option

In [7]:
df = pd.read_csv("students.csv" , index_col = "id")

df.sample(frac = .25)  # to get 25% of total records

   name of students  marks
id
6             kajal    800
14          kaushal    800
7          himanshu    900
19            ankit    200
10             sonu    500

In [95]:
df = pd.read_csv("students.csv" , index_col = "id")

df.dtypes

df.dtypes.value_counts() # return no of columns w.r.t to data types

object    1
int64     1
dtype: int64

In [120]:
df = pd.read_csv("students.csv" , index_col = "id")

df.columns

Index(['name of students', 'marks'], dtype='object')

In [121]:
print(df.axes)

[Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
            20],
           dtype='int64', name='id'), Index(['name of students', 'marks'], dtype='object')]

In [123]:
# how to select only one requird column from dataframe

# df.column_name

# df["column_name"]

In [130]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,None]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , pd.NA]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla
4   50   None  5000       <NA>

In [131]:
df["esal"]
print(df.esal)

0    1000
1    2000
2    3000
3    4000
4    5000
Name: esal, dtype: int64

In [132]:
# if col name contain space

# df["column name"]  -- recommended

In [134]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,None]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , pd.NA]

df = pd.DataFrame({"eno":eno , "e name":ename , "esal":esal , "eadrs":eadrs})

df

   eno e name  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla
4   50   None  5000       <NA>

In [138]:
df["e name"]

df.e name    #  --> invalid

SyntaxError: invalid syntax (<ipython-input-138-f300ae8b271b>, line 3)

In [140]:
# how to select multiple column from dataframe

# df[[list of required columns]]

In [141]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,None]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , pd.NA]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

In [145]:
df[["eno" , "esal"]]

# or 

x = ["eno" , "ename"]

df[x]

   eno  ename
0   10  nitin
1   20   tina
2   30   arun
3   40   riya
4   50   None

In [155]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,"padam"]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , "agra"]
marks = [30,40,50,60,70]

df = pd.DataFrame({"c1":eno , "c2":ename , "c3":esal , "c4":eadrs , "c5":marks})

df

   c1     c2    c3         c4  c5
0  10  nitin  1000       doon  30
1  20   tina  2000      delhi  40
2  30   arun  3000  rishikesh  50
3  40   riya  4000     shimla  60
4  50  padam  5000       agra  70

In [157]:
# to select c2 and c4 col

df[["c2" , "c4"]]

      c2         c4
0  nitin       doon
1   tina      delhi
2   arun  rishikesh
3   riya     shimla
4  padam       agra

In [158]:
# to get c2 to c5 in reverse order

df[["c5","c4" , "c3" , "c2"]]

   c5         c4    c3     c2
0  30       doon  1000  nitin
1  40      delhi  2000   tina
2  50  rishikesh  3000   arun
3  60     shimla  4000   riya
4  70       agra  5000  padam

In [161]:
import pandas as pd

eno = [10,20,30,40 , 50]
ename = ["nitin" , "tina" , "arun" ,"riya" ,"tannu"]
esal = [1000,2000,3000,4000 , 5000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla" , "agra"]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df.to_csv("emp.csv" , index = False)